Alvin0523/mdp_stm32/src/selftest.c
/**
 * @file selftest.c
 * @brief Boot-time self-test sequence implementation.
 *
 * Trigger: hold PE0 (the onboard user button) down while the board resets
 * or powers on. Runs once, before the main loop, so it doesn't interfere
 * with normal operation or the host command fail-safe.
 *
 * Only PE8 is a GPIO-controllable LED on this board (confirmed against the
 * WHEELTEC resource-allocation PDF) - the LED1-LED4 silkscreen labels seen
 * on the schematic are hardwired power-rail/SWD indicators, not something
 * firmware can drive. So each test phase is signalled by a distinct PE8
 * blink count instead of separate LEDs.
 *
 * servo_set_angle() uses WHEELTEC's reference cubic PWM-vs-angle fit
 * (servo.c). Sign convention CONFIRMED ON PHYSICAL HARDWARE (2026-09-03):
 * positive = left, negative = right (matches REP-103). Operating clamps
 * (servo.h) are this unit's own hardware-measured real limits: left
 * 50-55deg chassis contact (2deg margin -> 48deg), right 26deg stall
 * (2deg margin -> 24deg) - see docs/stm32/tuning.md for the full decision
 * record, including how the LEFT/RIGHT labels got corrected after the
 * sign convention was pinned down (the sweeps were run before that).
 *
 * MINI COMPONENT TEST (current default - steering calibration is done, see
 * servo.h; this is the routine "are the basics still working" sequence,
 * not a calibration tool). Each phase advances automatically once its own
 * motion finishes - no button press needed mid-sequence:
 *   1 blink  = FWD 1 REV  - drives both rear wheels forward one wheel
 *              revolution open-loop (PID paused), tracking each wheel's own
 *              encoder independently. Confirms both motors AND both
 *              encoders respond.
 *   2 blinks = REV 1 REV  - same, in reverse.
 *   3 blinks = SERVO SWEEP - steering to the calibrated left max
 *              (SERVO_ANGLE_MAX_LEFT_RAD), hold, back to center, then the
 *              calibrated right max (SERVO_ANGLE_MAX_RIGHT_RAD), hold, back
 *              to center. Confirms the servo can actually reach both
 *              calibrated limits without stalling.
 *   4 blinks = STRAIGHT LINE - drives forward through the real PID loop
 *              (motor_pid, not open-loop) with steering centered at the
 *              measured 1490us. End-to-end check: motors, encoders, PID,
 *              and steering center all working together.
 *   DONE     = 2 quick blinks, motors off, steering re-centered.
 *
 * Refusal (motor switch OFF) is a distinct standalone 5-blink pattern with
 * a different on/off timing (100ms/100ms vs. the phases' 150ms/150ms).
 *
 * The steering-calibration tooling used to find the numbers above (raw-pulse
 * sweeps, center trim, protractor measurement phases) is still in this file
 * but disabled in selftest_run() - re-enable only to re-calibrate, not for
 * routine testing. See the RAW-PULSE CALIBRATION block below for that.
 */

#include "selftest.h"
#include "stm32f4xx_hal.h"
#include "motor.h"
#include "servo.h"
#include "button.h"
#include "encoder.h"
#include "oled.h"
#include <stdlib.h>
#include <stdio.h>

/* Ticks per wheel revolution: see docs/stm32/protocol.md /
 * mdp_hardware_bridge's kTicksPerWheelRev - sourced from WHEELTEC's vendor
 * reference firmware (EncoderMultiples * Hall_13 * HALL_30F). */
#define SELFTEST_TICKS_PER_REV 1560
#define SELFTEST_DRIVE_PCT     30
#define SELFTEST_DRIVE_TIMEOUT_MS 5000U /* safety: give up if wheels don't turn */

/* Servo sweep timing - see docs/stm32/control_loop.md ("Servo range").
 * Confirmed final per-side limits live in servo.h
 * (SERVO_ANGLE_MAX_LEFT_RAD/SERVO_ANGLE_MAX_RIGHT_RAD), not duplicated here.
 * Step size is defined in degrees purely because that's a more intuitive
 * unit for a human picking a sweep resolution - converted to radians once,
 * immediately, since servo_set_angle()/servo_set_angle_raw() take radians
 * (matching REP-103 / the rest of the stack, see servo.h). */
#define SELFTEST_SERVO_SWEEP_STEP_DEG   1.0f
#define SELFTEST_SERVO_SWEEP_STEP_RAD   (SELFTEST_SERVO_SWEEP_STEP_DEG * 3.14159265f / 180.0f)
/* Ranges start just under the CURRENT operating clamp (servo.h) and sweep
 * past it - the point is to find where the real mechanical lock/stall is,
 * which is confirmed further out than the current provisional clamp on at
 * least the right side. Still safe regardless of how far these go: the
 * cubic mapping's own hard PWM clamp (servo.c, SERVO_WT_PWM_MIN/MAX_US)
 * caps the actual pulse sent to WHEELTEC's own tested-safe bound no matter
 * what angle is requested here. */
/* LEFT = positive, RIGHT = negative - confirmed on physical hardware
 * (servo.h). These ranges/values are unchanged from the original sweeps;
 * only the LEFT/RIGHT labels were corrected after that confirmation (the
 * sweeps were run before the sign convention was pinned down - see
 * docs/stm32/tuning.md). */
#define SELFTEST_SERVO_LEFT_FINE_START_DEG  40.0f
#define SELFTEST_SERVO_LEFT_FINE_END_DEG    55.0f
#define SELFTEST_SERVO_LEFT_FINE_START_RAD  (SELFTEST_SERVO_LEFT_FINE_START_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_LEFT_FINE_END_RAD    (SELFTEST_SERVO_LEFT_FINE_END_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_RIGHT_FINE_START_DEG (-22.0f)
#define SELFTEST_SERVO_RIGHT_FINE_END_DEG   (-40.0f)
#define SELFTEST_SERVO_RIGHT_FINE_START_RAD (SELFTEST_SERVO_RIGHT_FINE_START_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_RIGHT_FINE_END_RAD   (SELFTEST_SERVO_RIGHT_FINE_END_DEG * 3.14159265f / 180.0f)
#define SELFTEST_SERVO_SWEEP_HOLD_MS    1500U

/* Straight-line PID test: target wheel speed and run duration. 5 rad/s is
 * roughly 15% of MOTOR_MAX_WHEEL_RAD_S (34.56) - slow enough to stay
 * controllable indoors, fast enough that the PID is actually working. 4s is
 * long enough to see a curve develop; the 1-wheel-revolution drive phases
 * are far too short for that. */
#define SELFTEST_STRAIGHT_RAD_S 5.0f
#define SELFTEST_STRAIGHT_MS    4000U

static void blink_pe8(uint8_t times, uint32_t on_ms, uint32_t off_ms)
{
    for (uint8_t i = 0; i < times; i++) {
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8, GPIO_PIN_SET);
        HAL_Delay(on_ms);
        HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8, GPIO_PIN_RESET);
        HAL_Delay(off_ms);
    }
}

static void drive_ticks(int16_t pct, int32_t target_ticks)
{
    encoder_get_delta_a();
    encoder_get_delta_b();

    /* Track and stop each wheel independently - motors are never perfectly
     * matched, so averaging left+right (the old approach) could stop one
     * wheel short of a full revolution while overshooting the other. */
    int32_t accumulated_a = 0;
    int32_t accumulated_b = 0;
    uint8_t done_a = 0;
    uint8_t done_b = 0;
    uint32_t start_tick = HAL_GetTick();

    motor_set_speed(pct, pct);
    while (!done_a || !done_b) {
        if (!done_a) {
            accumulated_a += labs(encoder_get_delta_a());
            if (accumulated_a >= target_ticks) {
                done_a = 1;
            }
        }
        if (!done_b) {
            accumulated_b += labs(encoder_get_delta_b());
            if (accumulated_b >= target_ticks) {
                done_b = 1;
            }
        }
        motor_set_speed(done_a ? 0 : pct, done_b ? 0 : pct);

        if (HAL_GetTick() - start_tick > SELFTEST_DRIVE_TIMEOUT_MS) {
            break; /* wheels not turning (off ground / stuck?) - don't hang forever */
        }
        HAL_Delay(20);
    }
    motor_set_speed(0, 0);
    HAL_Delay(300); /* let it settle before the next phase */
}

