Alvin0523/mdp_stm32/src/selftest.c
    for (;;) {
        servo_set_pulse_us((uint16_t)pulse);

        snprintf(buf, sizeof(buf), "PULSE %4u us", (unsigned)servo_get_pulse_us());
        oled_show_string_8x16_offset(1, 0, buf);

        /* No timeout - hold this position until the button is pressed. */
        (void)wait_for_button_press(0xFFFFFFFFU);

        if (pulse + (int32_t)step_us > (int32_t)end_us) {
            return; /* window done, caller moves on (or holds, if last) */
        }
        pulse += (int32_t)step_us;
    }
}

/* Smooth automatic sweep, no button presses - center -> 900 -> 2500, 1us
 * steps. "20us/sec" requested -> 1us every 1000/20 = 50ms. OLED redraw is
 * throttled to every 4th step (~200ms) rather than every single 1us step
 * (~20Hz) - the bit-banged display write has its own overhead, and the
 * physical smoothness comes from the PWM step rate, not how often the
 * number on screen refreshes. */
#define SELFTEST_SMOOTH_STEP_US        1U
#define SELFTEST_SMOOTH_STEP_DELAY_MS 50U /* 1us / 50ms = 20us/sec */
#define SELFTEST_SMOOTH_OLED_EVERY_N   4U /* redraw every 4th step (~200ms) */

static void servo_cal_smooth_sweep_to(int32_t *pulse, int32_t target_us)
{
    char buf[20];
    const int32_t step = (target_us >= *pulse) ? (int32_t)SELFTEST_SMOOTH_STEP_US
                                                : -(int32_t)SELFTEST_SMOOTH_STEP_US;
    uint32_t n = 0;

    while (*pulse != target_us) {
        *pulse += step;
        servo_set_pulse_us((uint16_t)*pulse);
        HAL_Delay(SELFTEST_SMOOTH_STEP_DELAY_MS);

        if ((n++ % SELFTEST_SMOOTH_OLED_EVERY_N) == 0) {
            snprintf(buf, sizeof(buf), "PULSE %4u us", (unsigned)servo_get_pulse_us());
            oled_show_string_8x16_offset(1, 0, buf);
        }
    }
    /* Always show the true final value, even if it landed mid-throttle. */
    snprintf(buf, sizeof(buf), "PULSE %4u us", (unsigned)servo_get_pulse_us());
    oled_show_string_8x16_offset(1, 0, buf);
}

static void servo_cal_smooth_sweep(void)
{
    int32_t pulse = (int32_t)servo_pulse_center_us();

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "SMOOTH SWEEP");

    oled_show_string_8x16_offset(3, 0, "CTR -> 900");
    servo_cal_smooth_sweep_to(&pulse, 900);
    HAL_Delay(500); /* brief pause at the turnaround point */

    oled_show_string_8x16_offset(3, 0, "900 -> 2500");
    servo_cal_smooth_sweep_to(&pulse, 2500);

    oled_show_string_8x16_offset(2, 0, "DONE - HOLDING");
    for (;;) {
        HAL_Delay(1000);
    }
}

static void servo_cal_full_range(void)
{
    servo_cal_full_range_window(SELFTEST_FULLRANGE_LEFT_START_US, SELFTEST_FULLRANGE_LEFT_END_US,
                                 SELFTEST_FULLRANGE_STEP_US, "LEFT 840-950");
    servo_cal_full_range_window(SELFTEST_FULLRANGE_RIGHT_START_US, SELFTEST_FULLRANGE_RIGHT_END_US,
                                 SELFTEST_FULLRANGE_STEP_US, "RIGHT 2300-2500");

    /* Both windows done - hold at the last right-side value forever rather
     * than silently returning to the caller and re-centering. */
    oled_show_string_8x16_offset(2, 0, "BOTH DONE-HOLD");
    for (;;) {
        (void)wait_for_button_press(0xFFFFFFFFU);
    }
}

static void servo_cal_center_trim(void)
{
    char buf[20];
    int32_t pulse = (int32_t)SELFTEST_TRIM_START_US;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "CENTER TRIM");
    oled_show_string_8x16_offset(3, 0, "PE0=+5us PUSH");

    for (;;) {
        servo_set_pulse_us((uint16_t)pulse);

        snprintf(buf, sizeof(buf), "PULSE %4u us", (unsigned)servo_get_pulse_us());
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "CTR   %+4ld us",
                 (long)((int32_t)servo_get_pulse_us() - (int32_t)servo_pulse_center_us()));
        oled_show_string_8x16_offset(2, 0, buf);

        /* No timeout - hold this position until the button is pressed. */
        (void)wait_for_button_press(0xFFFFFFFFU);

        if (pulse + (int32_t)SELFTEST_TRIM_STEP_US <= (int32_t)SELFTEST_TRIM_END_US) {
            pulse += (int32_t)SELFTEST_TRIM_STEP_US;
        } else {
            /* Top of the range and still curving left - hold here rather
             * than wrapping or recentering, and raise SELFTEST_TRIM_END_US. */
            oled_show_string_8x16_offset(3, 0, "END-RAISE RANGE");
        }
    }
}

/* Angle-driven verify sweep: commands a REAL ANGLE (not a raw pulse) via
 * servo_set_angle_raw() (bypasses the operating clamp, same as the other
 * calibration tools, so the full measured range is reachable) and shows
 * both the commanded angle and the resulting PWM. Lets a protractor
 * reading at the wheel be checked directly against what the model predicts
 * for that angle - straight line on the left, cubic Hermite on the right
 * (see servo.c's servo_write_angle_unclamped()/servo_right_hermite_pulse_us()).
 * No timeout - hold each angle as long as needed to read the protractor,
 * PE0 for next step. */
#define SELFTEST_VERIFY_ANGLE_START_DEG (-29.5f)
#define SELFTEST_VERIFY_ANGLE_END_DEG     35.0f
#define SELFTEST_VERIFY_ANGLE_STEP_DEG     5.0f

static void servo_cal_verify_curve(void)
{
    char buf[20];
    float angle_deg = SELFTEST_VERIFY_ANGLE_START_DEG;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "VERIFY CURVE");
    oled_show_string_8x16_offset(3, 0, "PE0=next step");

    for (;;) {
        servo_set_angle_raw(angle_deg * (3.14159265f / 180.0f));

        snprintf(buf, sizeof(buf), "ANGLE %+5.1f deg", (double)angle_deg);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "PWM   %4u us", (unsigned)servo_get_pulse_us());
        oled_show_string_8x16_offset(2, 0, buf);

        /* No timeout - hold this angle until the button is pressed. */
        (void)wait_for_button_press(0xFFFFFFFFU);

        if (angle_deg + SELFTEST_VERIFY_ANGLE_STEP_DEG <= SELFTEST_VERIFY_ANGLE_END_DEG) {
            angle_deg += SELFTEST_VERIFY_ANGLE_STEP_DEG;
        } else {
            oled_show_string_8x16_offset(3, 0, "END - HOLDING");
        }
    }
}

/* --- Recorded (pulse, real angle) data points, for re-measurement ---
 *
 * Every angle here is a REAL protractor reading at the wheel, NOT the
 * "commanded" value the servo_set_angle*() functions take. That distinction
 * is the entire point: at 840us the cubic's commanded angle is 52.3deg while
 * the wheel actually sits at 35.0deg, so the commanded unit overstates
 * reality by roughly 1.5x and must never be recorded as if it were an angle.
 *
 * OPEN QUESTION on both entries below: WHICH WHEEL the protractor was on was
 * not recorded, and that single omission is what stops these two numbers
 * from being usable. It is not a bookkeeping nicety - it plausibly accounts
 * for the entire 35.0 vs. 29.5deg gap:
 *
 * One servo drives both front wheels through a shared tie-rod, so a given
 * physical wheel is the INNER wheel in one turn direction and the OUTER
 * wheel in the other. Ackermann geometry deliberately steers the inner wheel
 * harder than the outer. Measuring the same wheel at both locks therefore
 * yields an inner-wheel angle for one direction and an outer-wheel angle for
 * the other, and a several-degree difference between those is the mechanism
 * working correctly - not a left/right asymmetry.
 *
 * So 35.0 vs. 29.5deg may be inner-vs-outer rather than left-vs-right. Until
 * both wheels are measured at both locks, that cannot be told apart, and
 * mdp_description's URDF (which wants left_joint and right_joint separately)
 * cannot be updated either way. Four readings settle it:
 *   left lock  -> left wheel (inner),  right wheel (outer)
 *   right lock -> right wheel (inner), left wheel (outer) */
typedef struct {
    uint16_t    pulse_us;
    float       measured_deg; /* real wheel angle previously read here */
    const char *label;
} servo_cal_point_t;

static const servo_cal_point_t s_servo_cal_points[] = {
    {  840U, 35.0f, "LEFT  840" },  /* left mechanical limit (chassis contact) */
    { 2400U, 29.5f, "RIGHT 2400" }, /* NOT a confirmed limit - this was the old
                                     * SERVO_CAL_PULSE_MAX_US ceiling, and the
                                     * wheel was still tracking when it was
                                     * reached. See PHASE 2. */
};

