Alvin0523/mdp_stm32/src/selftest.c
/* Drives to each recorded point in turn, button-advanced, showing the pulse
 * alongside the angle previously measured there so the protractor reading
 * can be compared on the spot. Disagreement is itself the result worth
 * having - it would mean the earlier reading, the wheel identification, or
 * center calibration is off.
 *
 * Uses servo_set_pulse_us(), so the SERVO_ANGLE_MAX_LEFT/RIGHT_RAD operating
 * clamp does not apply - 840us is well outside it. Bounded only by
 * SERVO_CAL_PULSE_MIN/MAX_US. */
static void servo_cal_verify_points(void)
{
    char buf[20];
    const uint16_t center_us = servo_pulse_center_us();
    const uint8_t n = (uint8_t)(sizeof(s_servo_cal_points) / sizeof(s_servo_cal_points[0]));

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "VERIFY POINTS");
    oled_show_string_8x16_offset(3, 0, "PE0=next point");

    for (uint8_t i = 0; i < n; i++) {
        servo_set_pulse_us(s_servo_cal_points[i].pulse_us);

        snprintf(buf, sizeof(buf), "%-11s", s_servo_cal_points[i].label);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "WAS %+5.1f deg", (double)s_servo_cal_points[i].measured_deg);
        oled_show_string_8x16_offset(2, 0, buf);

        if (!wait_for_button_press(SELFTEST_CAL_STEP_TIMEOUT_MS)) {
            servo_set_pulse_us(center_us);
            oled_show_string_8x16_offset(1, 0, "TIMEOUT-CENTER  ");
            oled_show_string_8x16_offset(2, 0, "                ");
            HAL_Delay(1000);
            return;
        }
    }

    servo_set_pulse_us(center_us);
    oled_show_string_8x16_offset(1, 0, "POINTS DONE     ");
    oled_show_string_8x16_offset(2, 0, "                ");
    HAL_Delay(800);
}

/* Fine sweeps past the current operating clamp on each side, to find this
 * unit's real mechanical lock point - see docs/stm32/tuning.md. Uses
 * servo_set_angle_raw() to bypass the operating clamp (still bounded by
 * the hard PWM safety clamp in servo.c). WATCH/LISTEN while running: the
 * last angle with clean, unobstructed motion is the real limit - a stall
 * sounds like an audible buzz/whine with no visible motion, or the
 * knuckle visibly binding/scraping before the servo horn itself stops. */
static void servo_sweep_right_fine(void)
{
    servo_sweep_range(SELFTEST_SERVO_RIGHT_FINE_START_RAD, SELFTEST_SERVO_RIGHT_FINE_END_RAD,
                       "RIGHT FINE -22..-40", 1);
    servo_set_angle(0.0f);
    HAL_Delay(300);
}

static void servo_sweep_left_fine(void)
{
    servo_sweep_range(SELFTEST_SERVO_LEFT_FINE_START_RAD, SELFTEST_SERVO_LEFT_FINE_END_RAD,
                       "LEFT FINE 40-55", 1);
    servo_set_angle(0.0f);
    HAL_Delay(300);
}

/* Drives straight with steering centered, THROUGH THE PID LOOP - unlike
 * drive_ticks() above, which writes open-loop PWM with the loop paused and so
 * cannot test it.
 *
 * Displays both wheels' encoder-measured rad/s live against the target, which
 * is the diagnostic that matters here: if the two measured values sit near
 * the target and near each other but the car still curves, the PID is doing
 * its job and the fault is elsewhere (steering center, or unequal effective
 * wheel radius, which an encoder cannot see). If the measured values differ
 * from the target or from each other, the loop itself is not tracking and the
 * untuned MOTOR_PID_KP/KI are the place to look.
 *
 * Encoder deltas are NOT read here - the PID ISR is their sole consumer while
 * running, so this uses motor_pid_get_measured_rad_s() and times out on the
 * clock rather than counting ticks. */
static void servo_straight_line_pid(void)
{
    char buf[20];
    float left_rad_s = 0.0f, right_rad_s = 0.0f;

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "STRAIGHT PID");

    servo_set_angle(0.0f); /* real angle now - 0 maps to the measured center */
    HAL_Delay(400);

    motor_pid_resume(); /* selftest_run() paused it on entry */
    motor_pid_enable(1);
    motor_pid_set_target(SELFTEST_STRAIGHT_RAD_S, SELFTEST_STRAIGHT_RAD_S);

    const uint32_t start_tick = HAL_GetTick();
    while (HAL_GetTick() - start_tick < SELFTEST_STRAIGHT_MS) {
        motor_pid_get_measured_rad_s(&left_rad_s, &right_rad_s);

        snprintf(buf, sizeof(buf), "TGT %4.1f rad/s", (double)SELFTEST_STRAIGHT_RAD_S);
        oled_show_string_8x16_offset(1, 0, buf);
        snprintf(buf, sizeof(buf), "L%4.1f  R%4.1f", (double)left_rad_s, (double)right_rad_s);
        oled_show_string_8x16_offset(2, 0, buf);

        HAL_Delay(100);
    }

    motor_pid_set_target(0.0f, 0.0f);
    HAL_Delay(300);
    motor_pid_enable(0);
    motor_pid_pause();
    motor_set_speed(0, 0);

    oled_show_string_8x16_offset(1, 0, "STRAIGHT DONE   ");
    oled_show_string_8x16_offset(2, 0, "                ");
    HAL_Delay(500);
}

void selftest_run_if_requested(void)
{
    if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_0) != GPIO_PIN_RESET) {
        return; /* PE0 not held (pull-up idles high, pressed = low) */
    }

    selftest_run();
}

void selftest_run(void)
{
    if (motor_estop_engaged()) {
        blink_pe8(5, 100, 100); /* refused */
        return;
    }

    /* This whole sequence drives motors and reads encoder deltas directly
     * - the PID loop's TIM7 ISR (motor.c, docs/stm32/control_loop.md) does
     * both of those every 10ms in the background and would otherwise fight
     * us for the motors and steal our encoder ticks. */
    motor_pid_pause();

    oled_clear();
    oled_show_string_8x16_offset(0, 0, "SELF-TEST MODE");

    /* Phases 1-4 (mini component test: fwd/rev 1 rev, servo sweep,
     * straight-line PID drive) disabled while center-trim recalibration is
     * in progress, so a plain PE0 click goes straight to the trim tool
     * instead of sitting through ~15s of driving first. Re-enable
     * (uncomment) once a new center value is found and set - see the git
     * history for the original phase 1-4 block if restoring from scratch.
     *
     * blink_pe8(1, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "1: FWD 1 REV");
     * drive_ticks(SELFTEST_DRIVE_PCT, SELFTEST_TICKS_PER_REV);
     *
     * blink_pe8(2, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "2: REV 1 REV");
     * drive_ticks(-SELFTEST_DRIVE_PCT, SELFTEST_TICKS_PER_REV);
     *
     * blink_pe8(3, 150, 150);
     * oled_show_string_8x16_offset(1, 0, "3: SERVO SWEEP");
     * servo_sweep();
     *
     * blink_pe8(4, 150, 150);
     * servo_straight_line_pid();
     */

    /* Phase 5 - verify curve against a protractor. Commands real angles
     * (not raw pulses) in 5deg steps across the full range, showing both
     * the commanded angle and the resulting PWM - hold each step to check
     * the wheel's actual angle with a protractor against what's displayed.
     * Tests the new cubic Hermite mapping on the right side (servo.c)
     * against real measurements. Disable again (comment out) once done. */
    blink_pe8(2, 150, 150);
    servo_cal_verify_curve();

    /* ------------------------------------------------------------------
     * Remaining steering-calibration tooling below is intentionally NOT
     * part of the routine sequence above - re-enable individual calls here
     * only when actually re-calibrating, see the RAW-PULSE CALIBRATION
     * block and its functions' own doc comments further up this file.
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_center_trim();      // holds indefinitely, never returns
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_right_limit();      // sweeps 2380-2500us, 30s/step timeout
     *
     * blink_pe8(2, 150, 150);
     * servo_cal_verify_points();
     *
     * servo_cal_left_limit();
     *
     * blink_pe8(3, 150, 150);
     * servo_cal_measure();          // PHASE B, full-range protractor sweep
     *
     * servo_sweep_left_fine();      // superseded by raw-pulse calibration -
     * servo_sweep_right_fine();     // reference only, see block comment above
     * ------------------------------------------------------------------ */

    /* Return to center and finish */
    servo_set_angle(0.0f);
    oled_show_string_8x16_offset(1, 0, "DONE            ");
    blink_pe8(2, 80, 80);

    motor_pid_resume();
}
